novaeco/Lizard-Environnement-dev/TerrariumCalc-ESP32S3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SPIRAM=y
CONFIG_ESP_PSRAM=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LV_CONF_SKIP=n
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_INFO=y
CONFIG_LVGL_PORT_USE_PSRAM=y
CONFIG_LVGL_PORT_DISPLAY_RGB_REFRESH_TASK_PRIORITY=4
CONFIG_LVGL_PORT_DISPLAY_STACK_SIZE=8192
CONFIG_LVGL_PORT_TOUCH_STACK_SIZE=4096
CONFIG_HEAP_TRACING_OFF=y
